## Dimitrios Gkoumas (cs04502)
##
## Χρήση: matrixColSum(matrix)
##
## Προσθέτει τις στήλες του πίνακα και επιστρέφει πίνακα με τα αποτελέσματα

function colSum = matrixColSum (matrix)

  ## Παίρνουμε τις γραμμές και τις στήλες του πίνακα χρησιμοποιώντας το function
  ## size και τις αποθηκεύουμε στις μεταβλητές rows και cols αντίστοιχα
  [rows, cols] = size(matrix);

  ## Ελέγχουμε εάν ο πίνακας έχει τουλάχιστον μια γραμμή και μια στήλη. Εαν δεν
  ## έχει, επιστρέφουμε σφάλμα
  if (rows <= 0 || cols <= 0)
    error("Ο πίνακας που δόθηκε δεν είναι έγκυρος!")
  endif

  ## Δημιουργούμε πίνακα "γραμμή" στον οποίο θα βάλουμε το αποτέλεσμα
  ## Ο πίνακας θα έχει 1 γραμμή και "cols" στήλες
  colSum = zeros(1, cols);

  ## Για την πρόσθεση, χρησιμοποιούμε 2 δομές επανάληψης for
  ## Η πρώτη γίνεται από 1 έως τον αριθμό των γραμμών
  ## Και η δεύτερη γίνεται από 1 έως τον αριθμό των στηλών

  ## Έτσι καταφέρνουμε να προσθέσουμε τις στήλες και να βάλουμε το αποτέλεσμα
  ## στο colSum στην αντίστοιχη θέση ανά στήλη
  for i = 1:rows
    for m = 1:cols
      colSum(1, m) += matrix(i, m);
    endfor
  endfor

endfunction
